[
  "Even during peak hours, the pickup service kept the line moving.",
  "The front door looked well kept.",
  "Glad the high chairs were spotless.",
  "Great value for the portion size.",
  "My name was on the bag.",
  "Noticed the pickup shelf was tidy and welcoming.",
  "Even with a line, the front counter service kept the line moving. My chicken pieces were crispy and not greasy.",
  "The dining area felt composed and tidy.",
  "Shoutout to the crew for being polite.",
  "Everything felt dialed in.",
  "During the rush, the counter line was fast without feeling rushed. Really enjoyed the butterfly shrimp because it was flavorful and filling.",
  "This afternoon, the mobile pickup was quick and steady. Glad the chicken tenders were hot and well seasoned.",
  "The chairs were clean.",
  "Really enjoyed the butterfly shrimp because it was served at a great temperature.",
  "Even with a line, the front counter service kept the line moving. The apple pie was hot and well seasoned.",
  "My signature chicken was warm and satisfying.",
  "Glad the condiment station was neat and organized.",
  "Good portions, and a fair price.",
  "The curbside pickup stayed steady during lunch. Boneless wings were nicely seasoned!",
  "Really enjoyed the boneless wings because they were fresh out of the fryer.",
  "Fast service and hot food.",
  "Really appreciated how the staff were helpful.",
  "During the rush, the counter line was fast without feeling rushed. Loved the butterfly shrimp; it was crispy and not greasy.",
  "My wings were not overcooked.",
  "Glad the restrooms were well kept.",
  "The red beans and rice were hot and well seasoned and packed neatly.",
  "This afternoon, the mobile pickup was quick and steady. Glad the wings were fresh out of the fryer.",
  "Thanks to the kitchen team for being kind.",
  "My apple pie was tasty and filling.",
  "During the rush, the counter line was fast without feeling rushed. The mashed potatoes came out tender and juicy.",
  "Really appreciated how the window staff were kind.",
  "The atmosphere felt calm and welcoming.",
  "Great experience this evening.",
  "Glad the high chairs were freshly cleaned.",
  "My spicy chicken sandwich was cooked perfectly.",
  "even during lunch, the counter service was fast and organized.",
  "Thanks to the crew for being friendly.",
  "The tables looked stocked and clean.",
  "they followed my no-pickles request.",
  "Really liked that the pickup team made pickup easy.",
  "My bone-in chicken was nice and juicy.",
  "The lobby felt calm and welcoming.",
  "Smooth visit overall.",
  "Glad the chairs were neat and orderly.",
  "The chicken pieces came out hot and fresh.",
  "The manager was upbeat.",
  "The pace felt polished, and professional.",
  "Even during lunch, the mobile pickup kept a smooth pace.",
  "Really enjoyed the blackened chicken sandwich because it was seasoned just right.",
  "It was nice that the kitchen team checked that everything was correct.",
  "My wings were savory and satisfying.",
  "Glad the window attendant kept the handoff smooth!",
  "Despite with a line, the lobby line was fast without feeling rushed. Really enjoyed the mac and cheese because it was savory and satisfying.",
  "The vibe was calm and steady.",
  "Thanks to the shift lead for being professional.",
  "Even with a line, the front counter service kept the line moving. The boneless wings were savory and satisfying.",
  "fair price for what i got.",
  "My fries were hot and fresh.",
  "Really liked that the dining room staff double-checked the bag.",
  "They honored my extra sauce request.",
  "The order was ready on time.",
  "Noticed the dining room was tidy and welcoming.",
  "During the rush, the counter line was fast without feeling rushed. Blackened chicken sandwich was perfectly cooked.",
  "Thanks to the kitchen team for being upbeat.",
  "The curbside pickup stayed steady during lunch. The apple pie came out cooked perfectly.",
  "This afternoon, the mobile pickup was quick and steady. My sweet tea was refreshing and crisp.",
  "Really clean restrooms.",
  "The breading was light and crispy.",
  "Even during the rush, the drive-thru window kept a steady pace.",
  "Shoutout to the kitchen team for being courteous.",
  "Despite with a line, the lobby line was fast without feeling rushed. The spicy chicken sandwich was served at a great temperature and packed neatly.",
  "The floors were well kept.",
  "Really enjoyed the apple pie because it was tender and juicy.",
  "even with a line, the front counter service kept the line moving. the boneless wings were savory and satisfying.",
  "My biscuits were tasty and filling.",
  "Shoutout to the crew for being fast.",
  "Smooth visit this afternoon.",
  "The pickup process was simple.",
  "Even with a line, the front counter service kept the line moving. The spicy chicken sandwich was nice and juicy.",
  "Glad the condiment station was clean and inviting.",
  "The bags were labeled clearly.",
  "Super efficient team.",
  "Really enjoyed the tenders because they were crispy and not greasy.",
  "The pace felt polished and professional.",
  "Even with a line, the front counter service kept the line moving. The apple pie came out crisp and hot.",
  "Thanks to the kitchen team for being patient.",
  "Despite with a line, the lobby line was fast without feeling rushed. On top of that, the blackened tenders were savory and satisfying.",
  "The price felt right for what I got.",
  "Noticed the high chairs were clean.",
  "Even during the rush, the curbside pickup kept the line moving.",
  "Despite with a line, the lobby line was fast without feeling rushed. Chicken pieces were crispy and not greasy.",
  "The handoff was smooth and simple.",
  "Really appreciated how the dining room staff were professional.",
  "Clean condiment station.",
  "My boneless wings were tender and juicy.",
  "Glad the windows were not sticky.",
  "Mobile pickup was smooth and quick.",
  "Fast, friendly stop.",
  "Solid portions for the price.",
  "During peak hours, the drive-thru window was quick and steady. My blackened tenders were tender and juicy.",
  "Quick pickup, no hassle.",
  "Came in for a quick bite and it was smooth.",
  "The dining room felt fresh and tidy.",
  "Even during peak hours, the front counter service stayed organized and steady. The lemonade came out nice and cold.",
  "Noticed the restrooms were neat and orderly.",
  "During peak hours, the drive-thru line was quick and organized. Additionally, the wings were crispy and hot.",
  "Alex kept the visit steady and friendly.",
  "Super patient dining room staff.",
  "No issues with my order.",
  "My ghost pepper sandwich was full of flavor.",
  "Glad the dining room was neat and organized!",
  "During peak hours, the drive-thru line was quick and organized. Hot, well seasoned fries.",
  "The music level was just right.",
  "Appreciated how the front counter service was fast and organized.",
  "solid portions for the price.",
  "Shoutout to Michael for being so helpful.",
  "My strawberry pie was fresh and warm.",
  "Even late tonight, the pickup service kept the line moving.",
  "Thanks to the crew for being upbeat.",
  "During peak hours, the drive-thru window was quick and steady. Glad the lemonade was hit the spot.",
  "The lobby looked bright and clean.",
  "Really liked that the crew pointed me to the pickup shelf.",
  "Glad the front door was fresh and bright.",
  "Even during lunch, the counter service kept things on track. Really enjoyed the bone-in chicken because it was hot and fresh.",
  "Noticed the restrooms were well kept.",
  "came in and the visit was easy.",
  "The order was packed neatly.",
  "During peak hours, the drive-thru line was quick and organized. Loved the classic tenders; they were tender and juicy.",
  "Really appreciated how the dining room staff were courteous.",
  "Good value today.",
  "the app order matched exactly.",
  "Glad the dining room was neat, and organized.",
  "During peak hours, the drive-thru window was quick and steady. Really enjoyed the signature hot wings because they were full of flavor.",
  "The music was low and pleasant!",
  "Pulled up and the lobby line stayed steady.",
  "The lobby felt bright and open!",
  "Even during lunch, the window line kept things on track. Mac and cheese was creamy.",
  "Stopped by and it was easy.",
  "Quick thanks to the window staff who stayed calm and friendly.",
  "During peak hours, the drive-thru window was quick and steady. Really warm apple pie.",
  "Really appreciated how the dining room staff were efficient.",
  "Pulled up and everything flowed smoothly.",
  "The dining area had a calm flow.",
  "Even during peak hours, the front counter service stayed organized and smooth.",
  "Stopped by and pickup counter was easy to handle. The ghost pepper sandwich was full of flavor.",
  "The dining room staff were polite.",
  "Everything came together smoothly.",
  "Noticed the condiment station was clean and tidy.",
  "During peak hours, the drive-thru window was quick and steady. Mac and cheese was creamy and warm.",
  "Pickup went smoothly!",
  "Solid visit today.",
  "The restrooms were well kept.",
  "Appreciated how the front counter service kept things moving. Really enjoyed the blackened tenders because it was hot and fresh.",
  "Even during lunch, the window line kept things on track.",
  "Shoutout to the kitchen team for being calm under pressure.",
  "The space felt airy and open.",
  "During peak hours, the drive-thru window was quick and steady. The wings were well seasoned.",
  "Glad the dining room was neat and organized.",
  "Even during peak hours, the dine-in service kept the line moving.",
  "Noticed the chairs were well kept.",
  "Appreciated how the lobby line stayed organized and steady. Loved the classic tenders; they were crispy and not greasy.",
  "The vibe felt easy and inviting.",
  "Despite during lunch, the drive-thru line kept a smooth pace.",
  "Really clean floors.",
  "My classic chicken sandwich was flavorful and filling.",
  "The place felt relaxed, and comfortable.",
  "Even during lunch, the counter service kept things on track.",
  "Shoutout to the manager for being focused.",
  "Noticed the pickup counter was fast without feeling rushed. The unsweet tea was hit the spot.",
  "The chairs were spotless.",
  "It was nice that the kitchen team confirmed the order before I left.",
  "Thanks to the crew for being courteous.",
  "My strawberry pie was warm and sweet.",
  "Efficient visit overall.",
  "Glad the tables were wiped down.",
  "Quick thanks to the dining room staff who handled the rush well.",
  "Props for how the pickup counter was fast and organized.",
  "The flow inside felt smooth.",
  "during peak hours, the drive-thru window was quick and steady. the chicken pieces were crispy and hot and packed neatly.",
  "Shoutout to the team for being friendly.",
  "The receipt matched what I ordered.",
  "The chairs were well kept.",
  "During peak hours, the drive-thru line was quick and organized. My chicken sandwich combo was cooked perfectly.",
  "Really liked that the crew kept things moving without rushing.",
  "Drive-thru was quick.",
  "The high chairs looked spotless.",
  "Noticed the pickup counter was fast without feeling rushed. Lemonade was nice and cold.",
  "Despite during peak hours, the pickup counter moved along smoothly.",
  "The vibe was composed and steady.",
  "Glad the high chairs were clean.",
  "Even during peak hours, the front counter service stayed organized and steady. Bbq wings were well seasoned.",
  "The pickup shelf had my name spelled right.",
  "Glad the dining room staff made sure I had what I needed.",
  "Steady visit this evening.",
  "My signature chicken was juicy and flavorful.",
  "Loved how the drive-thru line kept the line moving.",
  "The bag matched what we talked through.",
  "The lobby felt bright and open.",
  "Fast front counter service. The spicy chicken sandwich was hot and well seasoned.",
  "Noticed the pickup shelf was fresh and bright.",
  "The visit felt easy and well managed.",
  "The lighting was soft and easy on the eyes.",
  "Well-paced lobby line today. Bbq wings were well seasoned.",
  "Stopped by and the counter line kept a steady pace.",
  "The dining area felt relaxed and open.",
  "Noticed the high chairs were freshly cleaned.",
  "Well-paced dine-in service today. The classic tenders were well seasoned.",
  "My order was checked, and accurate.",
  "Came in and everything was handled smoothly.",
  "Quick thanks to the crew who answered my questions.",
  "In and out pickup counter today. Boneless wings were crispy and hot.",
  "noticed the trash bins were neat and orderly.",
  "Felt like a good deal for the portion size.",
  "It all matched without me checking twice.",
  "The bbq wings came out saucy and flavorful.",
  "Stopped by and curbside pickup was easy to handle.",
  "The condiment station looked neat, and organized.",
  "Quick thanks to the kitchen team who answered my questions.",
  "During the rush, the pickup service was fast without feeling rushed. Hot, fresh classic tenders.",
  "My sauces were packed correctly.",
  "Glad the high chairs were neat, and orderly.",
  "The dining room felt spaced out and easy to move through.",
  "Well-paced lobby line today. Hot, fresh bone-in chicken.",
  "Noticed the lobby was tidy and welcoming.",
  "The pickup team were friendly.",
  "The place felt relaxed and comfortable.",
  "Appreciated how the drive-thru window no bottlenecks. The sweet tea tasted fresh and not flat.",
  "Fast, welcoming stop.",
  "Felt like a good deal for the portion size!",
  "Popeyes service was quick today.",
  "My chicken sandwich combo was hot and well seasoned.",
  "Came in and the visit was easy.",
  "Glad the trash bins were stocked and clean.",
  "Stopped by and counter line was easy to handle.",
  "Fast front counter service. Enjoyed the bbq wings; they were saucy and flavorful.",
  "The shift lead answered my questions.",
  "Noticed the front door was comfortable and clean!",
  "Loved how the mobile pickup moved quickly.",
  "Window line kept moving. Bbq wings were saucy.",
  "The visit was well organized.",
  "Glad the condiment station was fresh, and bright.",
  "Glad the counter attendant noticed I was waiting and checked in.",
  "Window line kept moving. The strawberry pie was sweet and warm.",
  "Quick thanks to the team who checked that everything was correct.",
  "Window line kept moving. Nice and fresh red beans and rice.",
  "the bags were labeled clearly.",
  "Stopped by and the front counter service stayed steady!",
  "The store felt calm even with some traffic.",
  "Well-paced lobby line today. Hot, fresh signature chicken.",
  "Noticed the restrooms were freshly cleaned.",
  "Short wait time.",
  "The pickup flow was smooth.",
  "Came in and the front counter service no bottlenecks. Glad the ghost pepper sandwich was cooked perfectly.",
  "Noticed the lobby was comfortable and clean.",
  "the sides were still warm by the time i got to the table.",
  "During the rush, the drive-thru line moved quickly.",
  "Glad the unsweet tea was tasted fresh.",
  "Window line kept moving. Classic tenders were fresh.",
  "It felt comfortable to sit and eat there.",
  "The lighting was bright and comfortable!",
  "Appreciated how the dine-in service kept the line moving.",
  "Window line kept moving. Glad the signature chicken was cooked perfectly.",
  "The lobby was clean and inviting.",
  "Pulled up and things moved fast.",
  "It was nice that the staff called out orders clearly.",
  "Stopped by and the pickup counter was fast without feeling rushed. The cajun fries were crisp and hot.",
  "In and out pickup counter today. Lemonade was cold and steady.",
  "The lobby felt relaxed and open.",
  "Glad the team made the visit easy.",
  "The pickup handoff felt organized.",
  "Quick front counter service. The chicken pieces came out crispy and hot.",
  "Window line kept moving. Glad the chicken family bundle was filling and satisfying.",
  "Noticed the trash bins were well kept.",
  "Noticed the trash bins were freshly cleaned.",
  "The pickup area was clean and simple to navigate.",
  "Window line kept moving. Chicken sandwich combo was well seasoned.",
  "The dining room staff felt attentive today.",
  "The visit was smooth and quick.",
  "Appreciated how the window line handled the rush well.",
  "Went with the strawberry pie and it hit the spot.",
  "Glad the dining room was clean and inviting.",
  "The dining room staff made the visit easy.",
  "Well-paced lobby line today. The sides hit the spot.",
  "Loved how the mobile pickup moved quickly. The bone-in chicken was juicy and flavorful.",
  "Everything was handled well.",
  "Worth it for the portions.",
  "Came in and the mobile pickup moved quickly.",
  "My bone-in chicken was well seasoned.",
  "It was easy to ask the cashier a question.",
  "Clean restrooms.",
  "Appreciated how the pickup service kept the line moving.",
  "The receipt was accurate.",
  "Well-paced dine-in service today. The fries were well seasoned.",
  "Glad the manager greeted me with a smile.",
  "It was nice that the dining room staff confirmed the order before I left.",
  "They asked if I needed anything else.",
  "Well-paced dine-in service today. Enjoyed the mac and cheese; it was cheesy and warm.",
  "Everything was separated neatly in the bag.",
  "Well-paced lobby line today. The batter was crispy without being greasy.",
  "Quick and easy stop.",
  "Fast front counter service. My classic tenders were tender and juicy.",
  "Window line kept moving. The boneless wings were well seasoned.",
  "Clean and welcoming.",
  "Pickup was fast and hassle-free.",
  "Glad the dining room staff greeted me with a smile.",
  "Loved how the mobile pickup moved quickly. The tenders were well seasoned.",
  "The lobby was tidy and friendly.",
  "Noticed the windows were well kept.",
  "The dining room staff double-checked the bag!",
  "Window line kept moving. Unsweet tea was nice and cold.",
  "The lobby smelled clean.",
  "Pulled up and the service remained steady.",
  "The manager handled a quick request without fuss.",
  "Window line kept moving. The apple pie was fresh, and warm.",
  "worth the price today.",
  "Stopped by and the pickup counter ran smoothly.",
  "The dining room felt airy and relaxed.",
  "Well-paced lobby line today. Hot, spicy ghost pepper sandwich.",
  "Glad the condiment station was well kept.",
  "The pickup handoff was quick and clear.",
  "The dining room looked neat and organized.",
  "During the rush, the pickup service was fast without feeling rushed. Enjoyed the signature chicken; it was crispy and hot.",
  "Noticed the lobby was fresh and tidy.",
  "stopped by and the lobby line ran smoothly.",
  "Appreciated how the drive-thru window no bottlenecks. Glad the ghost pepper sandwich was spicy and well seasoned.",
  "the place felt relaxed and comfortable.",
  "The hot items were kept separate.",
  "The dine-in service ran smoothly.",
  "Well-paced lobby line today. Glad the boneless wings were tender and juicy.",
  "Glad the shift lead checked that everything was correct.",
  "It was nice that the kitchen team double-checked the bag.",
  "Stopped by and the pickup counter was quick without feeling rushed.",
  "My cajun fries were not too greasy.",
  "clean restrooms.",
  "The sauces were packed correctly.",
  "Came in and the drive-thru line moved quickly.",
  "Well-paced dine-in service today. Also, the sweet and spicy wings came out well seasoned.",
  "noticed the tables were stocked and clean.",
  "the bag matched what we talked through.",
  "Quick counter service.",
  "During the rush, the pickup service was fast without feeling rushed. Tenders were fresh.",
  "The restrooms were not sticky.",
  "Shoutout to Alex for being so helpful!",
  "Alexander handled my order with care.",
  "Well-paced dine-in service today. On top of that, the bbq wings came out tender and juicy.",
  "Window line kept moving. Glad the wings were crispy and hot.",
  "The lobby looked bright, and clean.",
  "glad the dining room staff greeted me with a smile.",
  "Henry handled my order with care.",
  "Well-paced lobby line today. The red beans and rice were well seasoned."
]