[
  "Nice flavor",
  "Good stop today",
  "Tasty food",
  "Sauce was good",
  "Will def be back",
  "Order accuracy was good",
  "Helpful and friendly",
  "Loved the meal",
  "Good vibes",
  "service was good today",
  "Loved the spicy flavor",
  "Chicken was hot",
  "order was accurte",
  "Dine in was a good experience",
  "Counter order was right",
  "Drive thru was quick",
  "Biscuits were warm and good",
  "Pickup line was quick",
  "Food was really good",
  "Will be back",
  "tasted fresh",
  "Staff was helpful",
  "Easy drive thru",
  "Good lunch",
  "Chicken was juicy",
  "pickup was easy",
  "Great experience",
  "Line moved quickly",
  "Pickup was on time today",
  "order was perfect",
  "Order came out right",
  "Drive thru order was correct",
  "Drive thru staff were polite",
  "good expierence",
  "No wait",
  "Order was packed right",
  "Counter visit was quick",
  "Service was on point",
  "Pickup was ready when I got there",
  "Dine in was chill and clean",
  "Drive thru service was great",
  "Everything was good today",
  "Mashed potatoes were good",
  "food tasted realy good",
  "Sides were fresh",
  "Mashed potatoes were tasty",
  "The staff were super friendly!",
  "Nice lunch",
  "Great visit",
  "Good service",
  "Friendly and quick",
  "Good experience in the drive thru",
  "Short wait",
  "Spice level was perfect",
  "Drive thru was friendly",
  "Everything was good",
  "Hot food and quick service",
  "Order was correct and came out fast.",
  "Order accuracy was great",
  "nice staff",
  "Food tasted real good",
  "food was cooked right",
  "Good dinner",
  "Hot and fresh",
  "pickup was quick",
  "order was done fast",
  "clean place",
  "Drive thru was smooth",
  "chiken was crispy",
  "Fast pickup",
  "Everything was fine",
  "No issues with my order",
  "Fresh and tasty",
  "Sandwich was crispy",
  "service was fast n nice",
  "App was easy to use",
  "Fresh food today",
  "loved the spicy sandwhich",
  "Nice service",
  "good price for the food",
  "Food was made right",
  "I liked the sides",
  "Wait time was short",
  "really good service",
  "Clean restroom",
  "Dine in area was tidy",
  "Good flavor",
  "Smooth visit",
  "Drive thru crew was friendly",
  "Would return",
  "Loved the seasoning",
  "Very nice staff",
  "Not too greasy",
  "Everything was packed right",
  "Staff were polite and helpful.",
  "Line was short",
  "Red beans and rice were tasty",
  "Nice, quick lunch stop.",
  "Clean and quick",
  "Quick and friendly",
  "Dine in food was hot",
  "Sauces were good",
  "Quick and easy service.",
  "thanks to alexander, everything felt organized and the service stayed friendly",
  "The tenders were juicy and tender and the team stayed organized",
  "Biscuits were warm and the team stayed organized.",
  "was good today and the team stayed organized",
  "Loved how the drive thru lane was clean",
  "they were quick even with a rush",
  "the sandwich held together and wasnt messy.",
  "I noticed drive thru staff were nice and the pace felt steady.",
  "service was smooth fr and the food was hot",
  "I had a pleasant visit and it went smooth end to end.",
  "the crew was on point fr",
  "Food was flavorful and the pace stayed smooth",
  "Drive thru staff were friendly and everything was right.",
  "Glad to see drive thru order was right",
  "Food was hot and fresh.",
  "picked up food for the family and everything was packed right",
  "the gravy was smooth and had great flavor",
  "Tables were arranged nicely and the pace felt smooth",
  "no wait at all and the food was hot when i got it",
  "Nice people working here and it was a good stop.",
  "grabbed food before a movie and it was right on time",
  "the coleslaw was crisp and fresh",
  "Clean dining room and the pace was consistent.",
  "pickup was smooth and everything was accurate",
  "Order was done quick and everything was correct.",
  "the cajun seasoning was flavorful and the food was hot when i got it",
  "No problems and they kept things moving.",
  "The biscuit was not dry and they kept things moving",
  "Micheal was very kind and helpfull",
  "no problems at all and the food was hot when i got it.",
  "the staff was real polite and helpful",
  "Great food and friendly employees",
  "Loved how the drive-thru line moved quickly. Loved the fries; it was served at a great temperature.",
  "My cajun fries were seasoned just right.",
  "Fast counter service.",
  "The classic chicken sandwich came out warm and satisfying!",
  "Glad the floors were clean.",
  "Even with a line, the dine-in service kept things moving. The fries came out seasoned just right.",
  "The crew were calm under pressure.",
  "Grabbed my order fast and went.",
  "Loved how the window line stayed steady.",
  "Quick window line. Loved the mac and cheese; it was full of flavor.",
  "The windows looked wiped down.",
  "Everything flowed smoothly from start to finish.",
  "Quick shoutout: the front counter service stayed steady. The sweet tea came out cold and refreshing.",
  "Fair price for what I got!",
  "They split the order into two bags for easy carry.",
  "The red beans and rice came out full of flavor.",
  "No issues at all.",
  "The window line was quick and organized during lunch. The tenders came out warm and satisfying.",
  "Hot, perfectly cooked tenders.",
  "Popeyes was clean and welcoming.",
  "Pickup was ready when I arrived.",
  "Loved how the drive-thru line stayed steady. Mashed potatoes was fresh out of the fryer.",
  "Even with a line, the pickup service was quick and organized. My nuggets were fresh out of the fryer.",
  "The window staff felt helpful today.",
  "The manager handled the rush well.",
  "Fast pickup service today. The mac and cheese was tasty and filling.",
  "The pickup shelf was easy to find.",
  "Tenders were crispy.",
  "Plus, Quick pickup service today. My lemonade was hit the spot.",
  "Even with a line, the counter line stayed steady. The mac and cheese was crispy and not greasy.",
  "Super polite crew.",
  "The window line was quick and organized during lunch. The cajun fries were nice and juicy!",
  "Even at dinner time, the counter service stayed smooth.",
  "Shoutout to the team for being patient.",
  "The food was packaged carefully.",
  "During the rush, the front counter service was quick and organized. Nuggets were not overcooked.",
  "Really enjoyed the red beans and rice because it was crispy and not greasy.",
  "Quick window line. Loved the coleslaw; it was served at a great temperature.",
  "The pickup handoff was easy.",
  "Fast pickup service today. The fries came out warm and satisfying.",
  "Loved how the window line stayed steady. Really enjoyed the fries because they were not overcooked.",
  "Fast pickup service today. The tenders came out served at a great temperature.",
  "Portions were generous.",
  "The biscuits was warm and satisfying.",
  "Even with a line, the pickup service was quick and organized. The cajun fries were not overcooked.",
  "The store looked sharp and organized.",
  "Quick shoutout: the front counter service stayed steady. Hot, perfectly cooked red beans and rice.",
  "It was nice that the staff checked that everything was correct.",
  "During the rush, the counter line moved quickly. Chicken sandwich combo was full of flavor.",
  "Service was efficient.",
  "Fast pickup service today. The mac and cheese came out full of flavor.",
  "The atmosphere was friendly.",
  "The combo was a good value.",
  "It was a clean, tidy, and calm stop.",
  "Even this afternoon, the dine-in service ran efficiently.",
  "The store had a welcoming vibe.",
  "During the rush, the counter line moved quickly. My chicken pieces were flavorful and filling.",
  "Really impressed by how coordinated the team was.",
  "The overall vibe felt friendly.",
  "Even with a line, the pickup service was quick and organized. My red beans and rice was seasoned just right.",
  "The combo was a good value!",
  "Fast and organized.",
  "The space felt organized even while busy.",
  "Fast pickup service today. My classic chicken sandwich was seasoned just right!",
  "Even with a line, the dine-in service kept things moving. Really enjoyed the biscuits because it was full of flavor!",
  "Fast pickup service today. The sweet tea came out nice and cold.",
  "The order was called out clearly.",
  "Really steady front counter service. The chicken sandwich combo came out not overcooked.",
  "This afternoon, the pickup service was fast without feeling rushed. The lemonade came out nice and cold!",
  "Popeyes staff were welcoming.",
  "Shoutout to the staff for being patient!",
  "Great value for a filling meal.",
  "Food from Popeyes was hot and fresh.",
  "The value was on point.",
  "Quick shoutout: the front counter service stayed steady. Loved the cajun fries; they were fresh out of the fryer.",
  "The staff handled the rush well.",
  "The window line kept a steady pace at dinner time!",
  "Service was efficient!",
  "My coleslaw was warm and satisfying.",
  "Happy with the visit.",
  "On top of that, Fast window line. The chicken sandwich combo was nice and juicy.",
  "The window line kept a steady pace at dinner time.",
  "Quick window line. Cajun fries were not overcooked.",
  "The drive-thru line kept a steady pace during the rush.",
  "Appreciated how the drive-thru line was quick and organized. The tenders were full of flavor.",
  "Great deal for the price.",
  "The pickup shelf was organized.",
  "The window line stayed steady during the rush. Hot, crispy fries.",
  "The lighting was bright and comfortable.",
  "The window line was fast, and organized with a line. Lemonade was just the right sweetness.",
  "The window line stayed steady during the rush. The mashed potatoes came out full of flavor.",
  "Fast pickup service today. The fries came out seasoned just right.",
  "On top of that, Big thanks to the counter attendant who greeted me with a smile.",
  "Even today, the counter line stayed steady. Lemonade was nice and cold.",
  "Quick window line. The nuggets came out fresh out of the fryer.",
  "The service pace was steady.",
  "The counter line was quick and organized during lunch. Hot, perfectly cooked chicken pieces.",
  "The dining area felt calm and tidy!",
  "The counter line was fast, and organized during lunch. My lemonade was just the right sweetness.",
  "It was nice that the dining room staff greeted me with a smile.",
  "The dining area felt calm and tidy.",
  "Even at dinner time, the window line kept the flow steady. My fries were tasty and filling.",
  "The window line was fast and organized with a line.",
  "Great value for a filling meal!",
  "Really steady front counter service.",
  "Quick shoutout: the counter line was fast, and organized. The biscuits was tasty and filling.",
  "They separated hot items from cold ones.",
  "My chicken sandwich combo was not overcooked.",
  "Even today, the dine-in service was quick without feeling rushed. My spicy chicken sandwich was warm and satisfying.",
  "Appreciated how the window line kept the flow steady.",
  "Super patient front counter team.",
  "Pickup was ready on time.",
  "Appreciated how the drive-thru line was fast, and organized. The coleslaw was full of flavor.",
  "Super calm under pressure team.",
  "Everything was exactly as requested.",
  "Really liked that the counter line was fast without feeling rushed. The cajun fries came out not overcooked!",
  "Really steady front counter service. Loved the tenders; they were fresh out of the fryer.",
  "My red beans and rice was nice and juicy.",
  "Pickup went smoothly.",
  "The dining area was pleasant.",
  "Fast pickup service today. Really enjoyed the chicken sandwich combo because it was served at a great temperature.",
  "Big thanks to the window attendant who kept things organized.",
  "They counted my change correctly.",
  "Appreciated how the drive-thru line was fast, and organized. Really enjoyed the classic chicken sandwich because it was full of flavor.",
  "Noticed the trash bins were spotless.",
  "The meal was filling for the cost.",
  "Quick window line. Classic chicken sandwich was nice and juicy.",
  "The window line stayed steady during the rush. The classic chicken sandwich was cooked perfectly!",
  "Fast pickup service today. My classic chicken sandwich was seasoned just right.",
  "The team kept things steady and calm.",
  "Even with a line, the pickup service was fast and organized.",
  "Loved how the drive-thru line stayed steady. Classic chicken sandwich was crispy and not greasy.",
  "Appreciated how the drive-thru line was fast, and organized. Really enjoyed the cajun fries because they were warm and satisfying.",
  "My mac and cheese was served at a great temperature.",
  "With a line, the dine-in service kept the flow steady.",
  "The red beans and rice tasted hearty.",
  "Even with a line, the pickup service was quick and organized. Hot, crispy fries.",
  "They got my order right the first time.",
  "It was nice that the front counter team made sure I had what I needed.",
  "Quick window line. Loved the chicken pieces; they were nice and juicy.",
  "The order matched the receipt.",
  "Shoutout to the window staff for being friendly.",
  "Quick window line. The nuggets were full of flavor.",
  "The staff confirmed the order before closing the bag.",
  "Also, The dining room felt bright and airy.",
  "The front counter team answered my questions.",
  "Quick window line. Classic chicken sandwich was perfectly cooked.",
  "Noticed the pickup shelf was well kept.",
  "Also, The window line was quick and organized with a line. Chicken sandwich combo was crispy and not greasy.",
  "The restrooms looked wiped down.",
  "Even at dinner time, the window line kept the flow smooth. Loved the fries; they were served at a great temperature.",
  "It was nice that the crew kept things organized.",
  "Even during lunch, the window line was fast without feeling rushed. Lemonade was not too sweet.",
  "The space felt open and easy to navigate.",
  "The dine-in service ran efficiently this afternoon.",
  "The counter service stayed smooth.",
  "The spicy chicken sandwich came out tasty and filling.",
  "The window line was quick and organized during lunch. Loved the lemonade; it was tasted fresh.",
  "Easy pickup experience.",
  "Appreciated how the drive-thru line was quick and organized. Really enjoyed the spicy chicken sandwich because it was crispy and not greasy.",
  "The spicy chicken sandwich was cooked perfectly.",
  "Fast pickup service today. The classic chicken sandwich was tasty and filling.",
  "With a line, the dine-in service kept the flow steady!",
  "During the rush, the front counter service was quick and organized. Loved the mashed potatoes; it was tasty and filling.",
  "The windows were well kept.",
  "My nuggets were hot, and fresh.",
  "Even with a line, the pickup service was quick and organized. Spicy chicken sandwich was crispy.",
  "Curbside pickup was easy.",
  "Even with a line, the drive-thru line kept things moving.",
  "Really steady front counter service. My classic chicken sandwich was crispy and not greasy.",
  "Quick window line. Really enjoyed the tenders because they were nice and juicy.",
  "Sauces were included in the bag.",
  "Everything was bagged correctly.",
  "The counter line was fast, and organized at dinner time. Mac and cheese was juicy.",
  "The red beans and rice was served at a great temperature.",
  "Staff was on it.",
  "Also, Noticed the front counter service kept things moving. My cajun fries were crispy and not greasy.",
  "On top of that, Pickup was ready on time.",
  "Loved how the drive-thru line stayed steady. The red beans and rice came out not overcooked.",
  "The special request was handled perfectly.",
  "During the rush, the front counter service was quick and organized. My mashed potatoes was crispy and not greasy.",
  "Loved how the drive-thru line stayed steady. The nuggets came out warm and satisfying.",
  "Really appreciated the cashier being focused!",
  "Really enjoyed the chicken pieces because they were warm and satisfying.",
  "Quick window line. The mac and cheese was served at a great temperature.",
  "Appreciated how the window line ran efficiently.",
  "Even during lunch, the counter line was fast without feeling rushed. Really enjoyed the classic chicken sandwich because it was seasoned just right.",
  "Pickup was smooth from start to finish.",
  "Pickup felt organized and quick.",
  "Everything was packed just how I asked.",
  "Loved how the drive-thru line stayed steady. Loved the cajun fries; they were seasoned just right!",
  "Even during lunch, the counter line was fast without feeling rushed. Biscuits was juicy.",
  "Loved the sweet tea; it was cold and refreshing.",
  "Shoutout to Alexander for being so helpful.",
  "The staff checked that everything was correct.",
  "Even with a line, the dine-in service kept things moving. Loved the red beans and rice; it was full of flavor.",
  "The dining room felt cozy and clean.",
  "Fast window line. The chicken pieces came out crispy and not greasy.",
  "Even with a line, the counter line stayed steady. Loved the spicy chicken sandwich; it was fresh out of the fryer.",
  "Quick pickup service today. The nuggets were nice and juicy.",
  "Loved how the pickup service kept the flow steady.",
  "Quick pickup service today. Really enjoyed the classic chicken sandwich because it was warm and satisfying.",
  "The restrooms looked spotless.",
  "Good portions and a fair price.",
  "Really liked that the counter line was fast without feeling rushed. Mac and cheese was seasoned just right.",
  "The window attendant was patient.",
  "The window line was fast, and organized with a line. The coleslaw came out crispy and not greasy.",
  "With a line, the pickup service kept things moving.",
  "Fast pickup service today. Really enjoyed the chicken sandwich combo because it was not overcooked.",
  "Even with a line, the counter line stayed steady. My nuggets were cooked perfectly.",
  "Popeyes staff were friendly.",
  "On top of that, Fast pickup service today. My biscuits was crispy and not greasy.",
  "Even with a line, the dine-in service kept things moving. Loved the spicy chicken sandwich; it was warm and satisfying.",
  "Fast pickup service today. My fries were full of flavor.",
  "The classic chicken sandwich came out warm and satisfying.",
  "Loved the mac and cheese; it was served at a great temperature.",
  "Even during lunch, the counter line was fast without feeling rushed. Really enjoyed the sweet tea because it was hit the spot.",
  "Loved the sweet tea; it was hit the spot.",
  "The portions felt just right.",
  "The visit felt effortless.",
  "The music was low and pleasant.",
  "This afternoon, the drive-thru line was quick and organized. Biscuits were perfectly cooked.",
  "Shoutout to the window staff for being focused.",
  "Popeyes handled the rush well.",
  "Fast pickup service. Classic chicken sandwich was fresh out of the fryer.",
  "Clean chairs.",
  "My order was checked and accurate.",
  "Really appreciated the manager being upbeat.",
  "The window line stayed steady with a line. Loved the spicy chicken sandwich; it was hot, and fresh.",
  "A quick, seamless stop.",
  "Noticed the tables were wiped down.",
  "Solid value and good portions.",
  "My payment was quick and easy!",
  "Appreciated how the drive-thru line stayed organized and steady!",
  "The window line stayed steady with a line. The chicken sandwich combo came out seasoned just right.",
  "Price felt fair for what I got.",
  "Shoutout to Alex for being so helpful.",
  "The bag was packed neatly and correctly.",
  "This morning, the front counter service was fast without feeling rushed. My coleslaw was full of flavor.",
  "Glad the counter attendant handled the rush well.",
  "Glad the manager kept things moving without rushing.",
  "Alex kept the visit smooth and friendly!",
  "My payment was fast and easy.",
  "Noticed the counter area was comfortable and clean!",
  "Appreciated how the dine-in service was quick and organized. The fries were hot and fresh.",
  "Popeyes kept things moving smoothly!",
  "The lobby felt light and comfortable.",
  "Shoutout to the counter attendant for being professional.",
  "During the rush, the counter service was quick and organized. Loved the sweet tea; it was tasted fresh.",
  "No stress, no fuss.",
  "My payment was quick and easy.",
  "Really appreciated how the staff were patient!",
  "Even with a line, the counter service was fast and organized.",
  "The value matched the portion size.",
  "Shoutout to Henry for being so helpful.",
  "Also, The meal was filling for the cost.",
  "My order was checked and accurate!",
  "Noticed the dining room was clean and tidy.",
  "Shoutout to the team for being kind.",
  "During the rush, the counter service was fast and organized. Tenders were crispy.",
  "The window line kept the flow steady.",
  "Glad the trash bins were freshly cleaned.",
  "Super upbeat dining room staff.",
  "This morning, the front counter service was fast without feeling rushed. My chicken pieces were fresh out of the fryer.",
  "The pickup handoff was easy!",
  "Really clean tables.",
  "Shoutout to the dining room staff for being calm under pressure!",
  "Nothing was missing.",
  "My order was correct.",
  "Appreciated how the dine-in service was fast, and organized. The biscuits were seasoned just right and packed neatly.",
  "Portions were satisfying.",
  "The crew made the visit easy.",
  "Glad the chairs were well kept.",
  "Even late tonight, the dine-in service was quick without feeling rushed.",
  "My classic chicken sandwich was tasty and filling.",
  "Shoutout to the dining room staff for being calm under pressure.",
  "Alexander kept the visit smooth and friendly.",
  "The store felt clean and inviting.",
  "Appreciated how the counter line was fast and organized. The fries were nice and juicy.",
  "Even during the rush, the counter service kept a smooth pace.",
  "Plus, Shoutout to the manager for being calm under pressure.",
  "Thanks to the window attendant for being polite.",
  "The lobby felt light, and comfortable.",
  "Loved how the pickup service kept the flow steady. Really well seasoned tenders.",
  "It was nice that the team kept things moving without rushing.",
  "Popeyes had the order ready quickly.",
  "Quick turnaround.",
  "My sweet tea was nice and cold.",
  "Popeyes made it quick and easy.",
  "Thanks for how the drive-thru window kept the flow steady.",
  "The restrooms were stocked and clean.",
  "Appreciated how the dine-in service was quick and organized. Nuggets were cooked perfectly.",
  "This was a standout visit.",
  "The front counter team were welcoming.",
  "Glad the floors were stocked and clean.",
  "Appreciated how the dine-in service was fast, and organized. Loved the cajun fries; they were flavorful and filling.",
  "Fair price for what I got.",
  "Fast pickup service.",
  "The manager was helpful.",
  "Glad the red beans and rice were hot and fresh.",
  "The store felt safe and well kept.",
  "Even during lunch, the front counter service stayed smooth.",
  "Shoutout to the dining room staff for being quick.",
  "My chicken sandwich combo was served at a great temperature.",
  "Friendly vibe inside.",
  "Noticed the floors were freshly cleaned.",
  "The order number was called clearly.",
  "This afternoon, the drive-thru line was quick and organized. Really enjoyed the cajun fries because they were cooked perfectly.",
  "Really appreciated how the crew were calm under pressure.",
  "The dining room felt bright and airy.",
  "Everything felt smooth.",
  "Shoutout to the window staff for being polite.",
  "Glad the mac and cheese was not overcooked.",
  "The dining room looked fresh and bright.",
  "Clean tables.",
  "Thanks for how the dine-in service kept a steady pace.",
  "My lemonade was nice and cold.",
  "Shoutout to the team for being quick.",
  "Popeyes was clean, and welcoming.",
  "The pickup shelf was neat and organized.",
  "Really enjoyed the chicken pieces because they were nice and juicy.",
  "Shoutout to the staff for being upbeat!",
  "Additionally, The space felt clean and welcoming.",
  "The counter area was clean and tidy.",
  "Glad the trash bins were well kept.",
  "Loved how the front counter service stayed steady. My fries were full of flavor!",
  "Solid value, and good portions.",
  "They repeated my order to confirm it.",
  "The visit was smooth, and quick.",
  "Really hot and fresh coleslaw.",
  "Good vibes all around.",
  "Henry at the counter was polite and quick.",
  "The front door was clean and tidy.",
  "Loved how the front counter service was quick and organized. Loved the spicy chicken sandwich; it was full of flavor.",
  "Super professional team.",
  "Plus, The store looked sharp and organized.",
  "It was nice that the staff made pickup easy.",
  "My nuggets were crisp and hot.",
  "Glad the dining room was clean and tidy.",
  "Quick thanks to the team who answered my questions.",
  "Even during the rush, the counter service kept a steady pace.",
  "The experience was pleasant.",
  "Noticed the tables were well kept.",
  "Popeyes kept things moving smoothly.",
  "During the rush, the counter service was quick and organized. The coleslaw was crisp and hot and packed neatly.",
  "Late tonight, the counter line kept a smooth pace.",
  "Additionally, The special request was handled perfectly.",
  "Everything in the bag matched what I asked for.",
  "The window line stayed steady with a line. Glad the fries were seasoned just right.",
  "Shoutout to the staff for being focused.",
  "Even during lunch, the drive-thru window moved quickly.",
  "On top of that, The lobby felt relaxed and open.",
  "Appreciated how the dine-in service was quick and organized. The cajun fries were warm and satisfying.",
  "The team were polite.",
  "Loved how the front counter service was quick and organized. The sides were portioned nicely!",
  "It felt easy from start to finish.",
  "During the rush, the counter service was quick and organized. The chicken sandwich combo came out served at a great temperature.",
  "The cashier was welcoming.",
  "Noticed the front door was comfortable and clean.",
  "At dinner time, the counter line was fast and organized.",
  "During the rush, the counter service was quick and organized. Mac and cheese was fresh out of the fryer.",
  "The store felt composed even with some traffic.",
  "Glad the restrooms were clean.",
  "Loved how the front counter service was fast and organized.",
  "Good value for the meal.",
  "The vibe was calm and smooth.",
  "Really appreciated how the staff were patient.",
  "This afternoon, the drive-thru window was quick without feeling rushed.",
  "My sweet tea was cold and refreshing.",
  "Noticed the trash bins were not sticky.",
  "The crew were attentive.",
  "Despite at dinner time, the drive-thru line stayed organized and steady.",
  "Really enjoyed the tenders because they were not overcooked.",
  "The trash bins were not sticky.",
  "The team were welcoming.",
  "The dining room felt comfortable.",
  "Even at dinner time, the front counter service stayed steady. The fries were warm and satisfying and packed neatly.",
  "Glad the restrooms were wiped down.",
  "Alex kept the visit smooth and friendly.",
  "Really liked that the staff made pickup easy.",
  "The spicy chicken sandwich was tasty, and filling.",
  "This afternoon, the mobile pickup was quick and steady. The biscuits were hot and well seasoned and packed neatly.",
  "Glad the restrooms were stocked and clean.",
  "My add-ons were included in the bag.",
  "Even during the rush, the curbside pickup kept things moving.",
  "Loved the apple pie; it was crisp and hot.",
  "The restrooms looked clean.",
  "The cajun fries came out fresh out of the fryer.",
  "Despite at dinner time, the curbside pickup kept a steady pace.",
  "Really appreciated the shift lead being quick.",
  "Really liked that the dining room staff kept the handoff smooth.",
  "Great portions for the cost.",
  "My blackened chicken sandwich was savory and satisfying.",
  "Noticed the dining room was fresh and bright.",
  "Even during peak hours, the pickup service kept the line moving.",
  "The front door looked well kept.",
  "Glad the high chairs were spotless.",
  "Great value for the portion size.",
  "My name was on the bag.",
  "Noticed the pickup shelf was tidy and welcoming.",
  "Even with a line, the front counter service kept the line moving. My chicken pieces were crispy and not greasy.",
  "The dining area felt composed and tidy.",
  "Shoutout to the crew for being polite.",
  "Everything felt dialed in.",
  "During the rush, the counter line was fast without feeling rushed. Really enjoyed the butterfly shrimp because it was flavorful and filling.",
  "This afternoon, the mobile pickup was quick and steady. Glad the chicken tenders were hot and well seasoned.",
  "The chairs were clean.",
  "Really enjoyed the butterfly shrimp because it was served at a great temperature.",
  "Even with a line, the front counter service kept the line moving. The apple pie was hot and well seasoned.",
  "My signature chicken was warm and satisfying.",
  "Glad the condiment station was neat and organized.",
  "Good portions, and a fair price.",
  "The curbside pickup stayed steady during lunch. Boneless wings were nicely seasoned!",
  "Really enjoyed the boneless wings because they were fresh out of the fryer.",
  "Fast service and hot food.",
  "Really appreciated how the staff were helpful.",
  "During the rush, the counter line was fast without feeling rushed. Loved the butterfly shrimp; it was crispy and not greasy.",
  "My wings were not overcooked.",
  "Glad the restrooms were well kept.",
  "The red beans and rice were hot and well seasoned and packed neatly.",
  "This afternoon, the mobile pickup was quick and steady. Glad the wings were fresh out of the fryer."
]